Revit 2027 API
BuiltInFailures.ProfileFailures Class
 Failures about Profile.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ProfileFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ProfileFailures
Public NotInheritable Class ProfileFailures
public ref class ProfileFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ProfileFailures = class end
The BuiltInFailures.ProfileFailures type exposes the following members.
Properties
Name | Description
SketchNotEmpty |  Can't move the Profile Plane because the Profile Sketch is not empty. This operation is not supported at this time.
Top
See Also
Reference
Autodesk.Revit.DB Namespace